examples/openfoam13/FoamPilotCases/Turning35Foundation13/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website: https://openfoam.org
    \\  /    A nd           | Version: 13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format ascii;
    class volScalarField;
    location "0";
    object k;
}
dimensions [0 2 -2 0 0 0 0];
internalField uniform 0.01;
boundaryField
{
    inlet { type fixedValue; value uniform 0.01; }
    outlet { type inletOutlet; inletValue uniform 0.01; value uniform 0.01; }
    sideA { type symmetryPlane; }
    sideB { type symmetryPlane; }
    bottom { type slip; }
    atmosphere { type inletOutlet; inletValue uniform 0.01; value uniform 0.01; }
    hull { type kqRWallFunction; value uniform 0.01; }
}
