examples/openfoam13/FoamPilotCases/Turning35Foundation13/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website: https://openfoam.org
    \\  /    A nd           | Version: 13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format ascii;
    class volScalarField;
    location "0";
    object nut;
}
dimensions [0 2 -1 0 0 0 0];
internalField uniform 0;
boundaryField
{
    inlet { type fixedValue; value uniform 0; }
    outlet { type inletOutlet; inletValue uniform 0; value uniform 0; }
    sideA { type symmetryPlane; }
    sideB { type symmetryPlane; }
    bottom { type slip; }
    atmosphere { type inletOutlet; inletValue uniform 0; value uniform 0; }
    hull { type nutkWallFunction; value uniform 0; }
}
