examples/openfoam13/FoamPilotCases/Turning35Foundation13/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website: https://openfoam.org
    \\  /    A nd           | Version: 13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format ascii;
    class volScalarField;
    location "0";
    object p_rgh;
}
dimensions [1 -1 -2 0 0 0 0];
internalField uniform 0;
boundaryField
{
    inlet { type fixedValue; value uniform 0; }
    outlet { type fixedFluxPressure; value uniform 0; }
    sideA { type symmetryPlane; }
    sideB { type symmetryPlane; }
    bottom { type fixedFluxPressure; value uniform 0; }
    atmosphere { type totalPressure; p0 uniform 0; }
    hull { type fixedFluxPressure; value uniform 0; }
}
