examples/openfoam13/FoamPilotCases/Turning35Foundation13/constant/marineProperties
FoamFile
{
    format ascii;
    class dictionary;
    object marineProperties;
}
mode turning35;
solver incompressibleVoF;
meshBackend snappyHexMesh;
fluid waterAir;
referenceSpeed 1.3381;
turningAngle 35;
turningStartTime 0.05;
